Дано: словарь per_cent с распределением процентных ставок по вкладам в различных банках таким образом, что ключ - название банка, значение - процент.
Задание: написать программу, в результате которой будет сформирован список deposit значений - накопленные средства за год вклада в каждом из банков.
На вход программы с клавиатуры вводится сумма money, которую человек планирует положить под проценты.

per_cent = {'ТКБ': 5.6, 'СКБ': 5.9, 'ВТБ': 4.28, 'СБЕР': 4.0}
money = int(input('Введите сумму вклада'))
deposit = []
for key in per_cent:
    deposit.append(per_cent[key] * money / 100)
print(deposit)

Например, сумма вклада 100000. 

per_cent = {'ТКБ': 5.6, 'СКБ': 5.9, 'ВТБ': 4.28, 'СБЕР': 4.0}
# money = int(input('Введите сумму вклада'))
money = 100000
deposit = []
for key in per_cent:
    deposit.append(per_cent[key] * money / 100)
print(deposit)

Результат работы программы:
[5600.0, 5900.0, 4280.0, 4000.0]

Добавим в программу поиск максимального значения депозита:

per_cent = {'ТКБ': 5.6, 'СКБ': 5.9, 'ВТБ': 4.28, 'СБЕР': 4.0}
money = int(input('Введите сумму вклада'))
deposit = []
for key in per_cent:
    deposit.append(per_cent[key] * money / 100)
    max_deposit = max(deposit)

print ("Максимальная сумма, которую вы можете заработать — " + str(max_deposit))

Результат работы программы при вкладе 100000:

per_cent = {'ТКБ': 5.6, 'СКБ': 5.9, 'ВТБ': 4.28, 'СБЕР': 4.0}
# money = int(input('Введите сумму вклада'))
money = 100000
deposit = []
for key in per_cent:
    deposit.append(per_cent[key] * money / 100)
    max_deposit = max(deposit)

print ("Максимальная сумма, которую вы можете заработать — " + str(max_deposit))

# Максимальная сумма, которую вы можете заработать — 5900.0